#include <iostream>
#include <windows.h>
#include <cmath>

using namespace std;

int main() {

    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    const double PI = 3.14159265358979323846;

    //Вправа_1 +
    double x, b;
    cout << "Введіть число Х: ";
    cin >> x;
    cout << "Введіть число B: ";
    cin >> b;

    if (x > b) {
        cout << "Х: " << x;
    }
    else {
        cout << "Х: " << x << '\n' << "B: " << b;
    }

    //Вправа_2 +
    /*
    double x1, x2, x3;
    cout << "Введіть значення Х1: ";
    cin >> x1;
    cout << "Введіть значення Х2: ";
    cin >> x2;
    cout << "Введіть значення Х3: ";
    cin >> x3;

    if ((1 < x1) && (x1 < 3)) {
        cout << x1 << '\n';
    }
    if ((1 < x2) && (x2 < 3)) {
        cout << x2 << '\n';
    }
    if ((1 < x3) && (x3 < 3)) {
        cout << x3 << '\n';
    }
    */

    //Вправа_3 +
    /*
    double x, y, z;
    cout << "Введіть значення Х: ";
    cin >> x;
    cout << "Введіть значення Y: ";
    cin >> y;
    if (x > y) {
        cout << "Z = " << x - y;
    }
    else {
        cout << "Z = " << y - x + 2;
    }
    */

    //Вправа_4 +
    /*
    double x, y, z;
    cout << "Введіть значення Х: ";
    cin >> x;
    cout << "Введіть значення Y: ";
    cin >> y;
    while (x == y){
        cout << "Значення Y не має = значенню Х" << '\n' << "Будь ласка, введіть інше значення Y: ";
        cin >> y;
    }
    cout << "Введіть значення Z: ";
    cin >> z;
    while ((x == z) || (y == z)){
        cout << "Значення Z не має = значенню Х або Y" << '\n' << "Будь ласка, введіть інше значення Z: ";
        cin >> z;
    }
    cout << std::endl << "Отримані значення: " << '\n' << "X = " << x << '\n' << "Y = " << y << '\n' << "Z = " << z << '\n'<< '\n';

    if ((x + y + z) < 1 ) {
        if ((x < y) && (x < z)) {
            x = (y + z) / 2;
            cout << "X = " << x;
        }
        else if ((y < x) && (y < z)) {
            y = (x + z) / 2;
            cout << "Y = " << y;
        }
        else {
            z = (x + y) / 2;
            cout << "Z = " << z;
        }
    }
    else {
        if (x < y) {
            x = (x + y) / 2;
            cout << "X = " << x;
        }
        else {
            y = (x + y) / 2;
            cout << "Y = " << y;
        }
    }
    */

    //Вправа_5  +
    /*
    double a, b, c, d;
    cout << "Введіть значення А: ";
    cin >> a;
    cout << "Введіть значення B: ";
    cin >> b;
    cout << "Введіть значення C: ";
    cin >> c;
    cout << "Введіть значення D: ";
    cin >> d;

    if (a <= b && b <= c && c <= d) {
         a = b = c = d;
    }
    else if (a > b && b > c && c > d) {

    }
    else {
        a = pow(a, 2);
        b = pow(b, 2);
        c = pow(c, 2);
        d = pow(d, 2);
    }

    cout << "значення А: " << a << '\n'
        << "значення B: " << b << '\n'
        << "значення C: " << c << '\n'
        << "значення D: " << d << '\n';
    */

    //Вправа_6 +
    /*
    double z, x, y, xy;
    cout << "Введіть значення Х: ";
    cin >> x;
    cout << "Введіть значення Y: ";
    cin >> y;

    xy = x * y;

    if (xy < 1) {
        z = atan((x + y) / (1 - xy));
    }
    else if ((xy > 1) && (x < -1)) {
        z = -PI + atan((x + y) / (1 - xy));
    }
    else if (x > 0 && xy > 1) {
        z = -PI + ((x + y) / (1 - xy));
    }
    else {
        z = 1.57;
    }

    cout << z ;
    */

    //Вправа_7 +
    /*
        // https://uk.calcprofi.com/rozrakhunok-trykutnyka-onlayn.html
    double a, b, c;
    cout << "Введіть значення сторін трикутника:" << '\n';
    cout << "Сторона А: ";
    cin >> a;
    cout << "Сторона В: ";
    cin >> b;
    cout << "Сторона C: ";
    cin >> c;

    if (c + b > a && c + a > b && b + a > c) {
        cout << "Трикутник існує" << '\n';
        if (a >= b && a >= c) {
            if (pow(a, 2) < pow(b, 2) + pow(c, 2)) {
                cout << "Трикутник гострокутний";
            }
            else if (pow(a, 2) == pow(b, 2) + pow(c, 2)) {
                cout << "Трикутник прямокутний";
            }
            else {
                cout << "Трикутник тупокутний";
            }
        }
        else if (b >= a && b >= c) {
            if (pow(b, 2) < pow(a, 2) + pow(c, 2)) {
                cout << "Трикутник гострокутний";
            }
            else if (pow(b, 2) == pow(a, 2) + pow(c, 2)) {
                cout << "Трикутник прямокутний";
            }
            else {
                cout << "Трикутник тупокутний";
            }
        }
        else {
            if (pow(c, 2) < pow(a, 2) + pow(b, 2)) {
                cout << "Трикутник гострокутний";
            }
            else if (pow(c, 2) == pow(b, 2) + pow(a, 2)) {
                cout << "Трикутник прямокутний";
            }
            else {
                cout << "Трикутник тупокутний";
            }
        }

    } else {
        cout << "Не існує";
    }
    */

    //Вправа_8 +
    /*
    double a, b, c, h, discr, x, x1, x2;

    cout << "Введіть значення числа h: ";
    cin >> h;
    a = sqrt((abs(sin(8 * h)) + 17) / (1 - sin(4 * h) * pow(cos(pow(h, 2) + 18), 2)));
    cout << "Значення а: " << a << '\n';
    b = 1 - sqrt( 3 / (3 + abs(tan(a * pow(h, 2)) - sin(a * h))) );
    cout << "Значення b: " << b << '\n';
    c = a * pow(h, 2) * sin(b * h) + b * pow(h, 3) * cos(a * h);
    cout << "Значення c: " << c << '\n' << '\n';

    discr = pow(b, 2) - 4 * a * c;
    cout << "Зрачення дискримінанта: " << discr << '\n';

    if (discr < 0){
        cout << "Корені не існують";
    }
    else if (discr == 0){
        cout << "Існує один корінь: ";
        x = -b / (2 * a);
        if (x == 0) // Ця умовна конструкція потрібна для усунення особливостей -> 'x = -0' типу даних double
            x = 0;
        cout << x;
    }
    else {
        cout << "Існує два кореня: " << '\n';
        x1 = (-b + sqrt(discr)) / (2 * a);
        x2 = (-b - sqrt(discr)) / (2 * a);
        cout << "Перший корінь: " << x1 << '\n' << "Другий корінь: " << x2 << std::endl;
    }
    */

    //Вправа_9
    /*
    double a1, a2, b1, b2, c1, c2;
    double d, dx, dy, x, y;
    cout << "Введіть значення а1: ";
    cin >> a1;
    cout << "Введіть значення а2: ";
    cin >> a2;
    cout << "Введіть значення b1: ";
    cin >> b1;
    cout << "Введіть значення b2: ";
    cin >> b2;
    cout << "Введіть значення c1: ";
    cin >> c1;
    cout << "Введіть значення c2: ";
    cin >> c2;

    d = a1 * b2 - a2 * b1; // головний визначник

    if (abs(d) >= 0.0001) {
        cout << "Так, нерівність виконується" << '\n';

        dx = b1 * c2 - b2 * c1;
        dy = c1 * a2 - c2 * a1;

        x = dx / d;
        y = dy / d;
        cout << "x = " << x << '\n';
        cout << "y = " << y;
    }
    else {
        cout << "Ні, не виконується";
    }
    */

    //Вправа_10 +
    /*
    double a, b;

    cout << "Введіть значення A: ";
    cin >> a;
    cout << "Введіть значення B: ";
    cin >> b;
    // Реалізація варіант А

    if (a < b) {
        a = b;
    }
    else {
        b = a;
    }

    // Реалізація варіант Б

    if (a < b) {
        a = b;
    }
    if (b < a) {
        b = a;
    }
    cout << "A = " << a << '\n';
    cout << "B = " << b;
    */

    //Вправа_11 + (зошит !!!!)
    /* А(-4, -2) B(2, 3) C(4, -2)
    double x1, x2, x3, y1, y2, y3;
    double s1, s2, s3, s4;
    cout << "Введіть Х1: ";
    cin >> x1;
    cout << "Введіть Х2: ";
    cin >> x2;
    cout << "Введіть Х3: ";
    cin >> x3;
    cout << "Введіть Y1: ";
    cin >> y1;
    cout << "Введіть Y2: ";
    cin >> y2;
    cout << "Введіть Y3: ";
    cin >> y3;


    // S1(х1;y1); (x2;y2); (x3;y3)
    // S2(0;0); (x2;y2); (x3;y3)
    // S3(х1;y1); (0;0); (x3;y3)
    // S4(х1;y1); (x2;y2); (0;0)


    //Площу трикутника за координатами його вершин
    s1 = 0.5 * abs((x2 - x1) * (y3 - y1) - (x3 - x1) * (y2 - y1)); // площа всього трикутника ABC
    s2 = 0.5 * abs((x2 - 0) * (y3 - 0) - (x3 - 0) * (y2 - 0));     // площа OBC
    s3 = 0.5 * abs((0 - x1) * (y3 - y1) - (x3 - x1) * (0 - y1));   // площа OАC
    s4 = 0.5 * abs((x2 - x1) * (0 - y1) - (0 - x1) * (y2 - y1));   // площа OAB

    cout << "S1 = " << s1 << '\n'
        << "S2 = " << s2 << '\n'
        << "S3 = " << s3 << '\n'
        << "S4 = " << s4 << '\n';
    // сума трьох малих площ дорівнює площі всього трикутника, за умови, що
    // початок координат усередині трикутника
    if (s2 + s3 + s4 == s1) {
        cout << "Трикутник належать початку координат";
    }
    else {
        cout << "Трикутник не належать початку координат";
    }
    */

    //Вправа_12 + (зошит !)
    /*
    double a, b, c, d;
    double rectangle1, rectangle2;
    cout << "Введіть значення А: ";
    cin >> a;
    cout << "Введіть значення B: ";
    cin >> b;
    cout << "Введіть значення C: ";
    cin >> c;
    cout << "Введіть значення D: ";
    cin >> d;

    while (a < 0 || b < 0 || c < 0 || d < 0) {
        cout << "Числа не можуть бути від'ємними !" << '\n';
        cout << "Введіть значення А: ";
        cin >>  a;
        cout << "Введіть значення B: ";
        cin >> b;
        cout << "Введіть значення C: ";
        cin >> c;
        cout << "Введіть значення D: ";
        cin >> d;
    }

    if ((a <= c && b <= d) || (a <= d && b <= c)) {
        cout << "Можна" << '\n' << "Прямокутник_1 зі сторонами А і В можна повністю помістити в прямокутник_2 зі сторонами С і D";
    }
    else {
        cout << "Не можна" << '\n' << "Прямокутник_1 зі сторонами А і В не можна повністю помістити в прямокутник_2 зі сторонами С і D";
    }
    */

    //Вправа_13
    /*
    double a, b, c, d;
    double rectangle1, rectangle2;
    cout << "Введіть значення А: ";
    cin >> a;
    cout << "Введіть значення B: ";
    cin >> b;
    cout << "Введіть значення C: ";
    cin >> c;
    cout << "Введіть значення D: ";
    cin >> d;

    while (a <= 0 || b <= 0 || c <= 0 || d <= 0) {
        cout << "Числа не можуть бути від'ємними !" << '\n';
        cout << "Введіть значення А: ";
        cin >> a;
        cout << "Введіть значення B: ";
        cin >> b;
        cout << "Введіть значення C: ";
        cin >> c;
        cout << "Введіть значення D: ";
        cin >> d;
    }

    if ((a <= c && b <= d) ||
        (a <= d && b <= c)) {

        cout << "Прямокутник можна помістити";
    }
    else {
        cout << "Прямокутник не можна помістити";
    }
    */

    //Вправа_14 +  (графіки)
    /*
    double x, y;
    char ploshyna;
    cout << "Виберіть площину від А до Л: ";
    cin >> ploshyna;
    cout << "Введіть Х: ";
    cin >> x;
    cout << "Введіть Y: ";
    cin >> y;
    // https://www.desmos.com/calculator/nnca8itinb?lang=uk
    switch (ploshyna) {
        case 'а':
            if (x >= -1 && x <= 1 && y <= 1 && y >= -1) {
                cout << "Точка _належить_ заштрихованій ділянці площини A";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини A";
            } break;
        case 'б':
            if (pow(x, 2) + pow(y, 2) <= 1) {
                cout << "Точка _належить_ заштрихованій ділянці площини Б";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини Б";
            } break;
        case 'в':
            if ((pow(x, 2) + pow(y, 2) <= 1) && (pow(x, 2) + pow(y, 2) >= 0.25)) {
                cout << "Точка _належить_ заштрихованій ділянці площини B";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини B";
            } break;
        case 'г':
            // Координати точок, що лежать на ромбі, задовольнити рівняння  |x| + |y| = 1.
            if (abs(x) + abs(y) <= 1) {
                cout << "Точка _належить_ заштрихованій ділянці площини Г";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини Г";
            } break;
        case 'д':
            if (abs(x) + 2 * abs(y) <= 1) {
                cout << "Точка _належить_ заштрихованій ділянці площини Д";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини Д";
            } break;
        case 'е':
            if ((x <= 0 &&                      // ліворуч від Y
                y <= x + 1 &&                   // нижче прямої y = x + 1
                y >= -x / 2 - 0.5) ||           // вище прямої y = -x/2 - 0.5
                (x >= 0 && pow(x, 2) + pow(y, 2) <= 1)) {  // праворуч від Y,  всередині одиничного кола
                cout << "Точка _належить_ заштрихованій ділянці площини Е";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини Е";
            } break;
        case 'ж':
            if (y >=-2 && y <= (3 * x) + 1 && y <= (- 3 * x) + 1) {
                cout << "Точка _належить_ заштрихованій ділянці площини Ж";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини Ж";
            } break;
        case 'з':
            if ((y <= 1 && y >= 0 && x >= -1 && x <=1) || (y <=0 && x >= -1 && y >= 2 * x) || (y <= 0 && y >= -x && x <= 1)) {
                cout << "Точка _належить_ заштрихованій ділянці площини З";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини З";
            } break;
        case 'і':
            if ((x <= 0 && y >= (-0.5 * x) - 1.5 && y <= x) || (x >= 0 && y >= (- 0.5 * x) - 1.5 && y <= (- 3 * x) + 1)) {
                cout << "Точка _належить_ заштрихованій ділянці площини І";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини І";
            } break;
        case 'к':
            if (y >= 0.5 || y >= (0.5 * x) - 0.5 && y >= (-0.5 * x) - 0.5) {
                cout << "Точка _належить_ заштрихованій ділянці площини К";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини К";
            } break;
        case 'л':
            if (y <= -1 || y <= (- 1.5 * x) + 0.5 && y <= (1.5 * x) + 0.5) {
                cout << "Точка _належить_ заштрихованій ділянці площини К";
            }
            else {
                cout << "Точка _не належить_ заштрихованій ділянці площини К";
            } break;
        default: cout << "хм.... такої площини не має";
    }
    */

    //Вправа_15 +  (графіки)
    /*
   double x, y;
   char oblasti;
   cout << "Виберіть від А до В: ";
   cin >> oblasti;
   cout << "Введіть Х: ";
   cin >> x;
   cout << "Введіть Y: ";
   cin >> y;

   switch (oblasti) {
       case 'а':
           if ((y <= 0 && x <= 0 && pow(x, 2) + pow(y, 2) >= 6.25) ||
               (y <= 0 && x >= 0 && pow(x, 2) + pow(y, 2) <= 1) ||
               (y >= 0 && x <= 0 && pow(x, 2) + pow(y, 2) <= 1) ||
               (y >= 0 && x >= 0 && pow(x, 2) + pow(y, 2) >= 1 && pow(x, 2) + pow(y, 2) <= 6.25)){
               cout << "Точка _належить_ заштрихованій області площини A";
           }
           else {
               cout << "Точка _не належить_ заштрихованій області площини A";
           } break;
       case 'б':
           if (abs(x) + abs(y) >= 2.5 ||
               y >= 1 && pow(x, 2) + pow(y, 2) <= 2 ||
               y <= -x && y <= x && pow(x, 2) + pow(y, 2) <= 2) {
               cout << "Точка _належить_ заштрихованій області площини Б";
           }
           else {
               cout << "Точка _не належить_ заштрихованій області площини Б";
           } break;
       case 'в':
           if (y >= - sin(x) && y <= sin(x)) {
               cout << "Точка _належить_ заштрихованій області площини В";
           }
           else {
               cout << "Точка _не належить_ заштрихованій області площини В";
           } break;
       default: cout << "хм.... щось пішло не так";
   }
   */

    //Вправа_16 +
    /*
   double a, b, c;
   double d, h;
   cout << "Введіть значення А: ";
   cin >> a;
   cout << "Введіть значення B: ";
   cin >> b;
   cout << "Введіть значення C: ";
   cin >> c;
   cout << "Введіть значення D: ";
   cin >> d;
   cout << "Введіть значення H: ";
   cin >> h;
   while (d <= 0 || h <= 0) {
       cout << '\n' << "Значення d і h мають бути додатніми" << '\n';
       cout << "Введіть значення D: ";
       cin >> d;
       cout << "Введіть значення H: ";
       cin >> h;
   }

   if (((a <= d && c <= h ) || (a <= h && c <= d)) ||
       ((c <= d && b <= h) || (c <= h && b <= d)) ||
       ((a <= d && b <= h) || (a <= h && b <= d))) {
       cout << "Цегла пройде у отвір";
   }
   else {
       cout << "Цегла не пройде у отвір";
   }
   */

    //Вправа_17 +
    /*
   double k, l, p, q;
   cout << "Введіть значення K: ";
   cin >> k;
   cout << "Введіть значення L: ";
   cin >> l;
   cout << "Введіть значення P: ";
   cin >> p;
   cout << "Введіть значення Q: ";
   cin >> q;

   if ((k == p && abs(l - q) == 1) ||
       (l == q && abs(k - p) == 1)) {
       cout << "Клітинки мають спільну сторону";
   }
   else {
       cout << "Клітинки не мають спільної сторони";
   }
   */

    //Вправа_18 +
    /*
   double v0, v1, t, v2, s1, s2;
   double distance1, distance2, allDistance;
   cout << "Введіть швидкість першого автомобіля v0: ";
   cin >> v0;
   cout << "Введіть швидкість другого автомобіля v1: ";
   cin >> v1;
   cout << "Введіть швидкість другого автомобіля v2: ";
   cin >> v2;
   cout << "Введіть відстань s1: ";
   cin >> s1;
   cout << "Введіть відстань s2: ";
   cin >> s2;

   t = s1 / v1 + s2 / v2;  // Час руху другого авт.
   distance1 = v0 * t;  //перший автомобіль
   distance2 = s1 + s2; //другий автомобіль
   allDistance = distance1 + distance2;

   cout << "Автомобілі рухалися до зустрічі: " << t << " год." << endl;
   cout << "Загальна відстань між A і B: " << allDistance << " км" << endl;
   if (distance1 > distance2) {
       cout << "Перший автомобіль проїхав більшу частину відстані";
   }
   else if (distance2 > distance1) {
       cout << "Другий автомобіль проїхав більшу частину відстані";
   }
   else {
       cout << "Автомобілі проїхали однакову відстань";
   }
   */

    //Вправа_19 +
    /*
   int year, n;
   cout << "Введіть рік: ";
   cin >> year;

   n = (year - 1924) % 60;
   switch (n % 12) {
       case 0: cout << "Пацюк, "; break;
       case 1: cout << "Корова, "; break;
       case 2: cout << "Тигр, "; break;
       case 3: cout << "Заєць, "; break;
       case 4: cout << "Дракон, "; break;
       case 5: cout << "Змія, "; break;
       case 6: cout << "Кінь, "; break;
       case 7: cout << "Вівця, "; break;
       case 8: cout << "Мавпа, "; break;
       case 9: cout << "Курка, "; break;
       case 10: cout << "Собака, "; break;
       case 11: cout << "Свиня, "; break;
   }
   if (n % 10 == 0 || n % 10 == 1)
       cout << "зелений";
   else if (n % 10 == 2 || n % 10 == 3)
       cout << "червоний";
   else if (n % 10 == 4 || n % 10 == 5)
       cout << "жовтий";
   else if (n % 10 == 6 || n % 10 == 7)
       cout << "білий";
   else
       cout << "чорний";
   */

    return 0;
}
